// Set
// Коллекции, содержащие уникальные элементы.
// ● Быстрая работа с данными.
// ● «Основан» на Map’ах без пары.
// ● Порядок добавления не хранится.


// HashSet
// isEmpty() – проверка на пустоту.
// add(V) – добавление элемента в коллекцию.
// remove(V) – удаление элемента из коллекцию.
// contains(V) – проверка на включение элемента в коллекции.
// clear() – удаление всех элементов коллекции.
// size() – возвращает количество элементов коллекции.
// addAll(Coll) – объединение множеств.
// retainAll(Coll) – пересечение множеств.
// removeAll(Coll) – разность множеств.

// TreeSet
// В основе HashMap.
// ● Упорядочен по возрастанию.
// ● null’ов быть не может.

// LinkedHashSet
// В основе HashMap.
// ● Помнит порядок.
// Использовать, когда нужен HashSet с запоминанием порядка элемента.


