// LinkedList
//Представляет собой двусвязный список.
// Список – гибкая структура данных, позволяющая легко менять свой
// размер. Элементы доступны для вставки или удаления в любой позиции.
// LinkedList нужен для небольшого количества
// элементов, в которых операции добавления\удаления
// встречаются чаще операций чтения.

// Queue - очередь, кто первый пришел тот и обрабатывается
// Queue<Integer> queue = new LinkedList<Integer>();

// PriorityQueue
// Наивысший приоритет имеет «наименьший» элемент.

// Deque
// Линейная коллекция, которая поддерживает вставку и удаление
// элементов на обоих концах. 